---
kind: property
id: P:Autodesk.Revit.DB.KeynoteEntry.KeynoteText
source: html/dbff893a-0faf-34bc-c79f-55ad173d1c93.htm
---
# Autodesk.Revit.DB.KeynoteEntry.KeynoteText Property

The text associated with this KeynoteEntry.

## Syntax (C#)
```csharp
public string KeynoteText { get; }
```

## Remarks
This value does not have to be set; if not set, the property returns an empty string.